PD.org
#+title: Pandas
#+INCLUDE: ../pdf.org
#+TAGS: AI
#+OPTIONS: toc:2 ^:nil num:5
#+PROPERTY: header-args :eval never-export
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../css/white.css" />
#+EXCLUDE_TAGS: noexport
#+latex:\newpage

* Pandas 簡介
Pandas 是 python 的一個數據分析 lib，2009 年底開源出來，提供高效能、簡易使用的資料格式(Data Frame)讓使用者可以快速操作及分析資料，主要特色描述如下[fn:1]：
1. 在異質數據的讀取、轉換和處理上，都讓分析人員更容易處理，例如：從列欄試算表中找到想要的值。
1. Pandas 提供兩種主要的資料結構，Series 與 DataFrame。Series 顧名思義就是用來處理時間序列相關的資料(如感測器資料等)，主要為建立索引的一維陣列。DataFrame 則是用來處理結構化(Table like)的資料，有列索引與欄標籤的二維資料集，例如關聯式資料庫、CSV 等等。
1. 透過載入至 Pandas 的資料結構物件後，可以透過結構化物件所提供的方法，來快速地進行資料的前處理，如資料補值，空值去除或取代等。
1. 更多的輸入來源及輸出整合性，例如：可以從資料庫讀取資料進入 Dataframe，也可將處理完的資料存回資料庫。

* Pandas 提供的資料結構
1. Series：用來處理時間序列相關的資料(如感測器資料等)，主要為建立索引的一維陣列。
2. DataFrame：用來處理結構化(Table like)的資料，有列索引與欄標籤的二維資料集，例如關聯式資料庫、CSV 等等。
3. Panel：用來處理有資料及索引、列索引與欄標籤的三維資料集。

* Pandas 實作
** 檔案讀寫
- 讀入
#+BEGIN_SRC python -r -n :results output :exports both
  import pandas as pd

  csv_file = "https://storage.googleapis.com/learn_pd_like_tidyverse/gapminder.csv"
  gapminder = pd.read_csv(csv_file)
  print(type(gapminder))
  print(gapminder.head())
#+END_SRC

#+RESULTS:
: <class 'pandas.core.frame.DataFrame'>
:        country continent  year  lifeExp       pop   gdpPercap
: 0  Afghanistan      Asia  1952   28.801   8425333  779.445314
: 1  Afghanistan      Asia  1957   30.332   9240934  820.853030
: 2  Afghanistan      Asia  1962   31.997  10267083  853.100710
: 3  Afghanistan      Asia  1967   34.020  11537966  836.197138
: 4  Afghanistan      Asia  1972   36.088  13079460  739.981106

- get remote csv to Google Colab
#+BEGIN_SRC python -r -n :results output :exports both :eval no
  #run on Google Colab
  import pandas as pd

  from google.colab import files
  uploaded = files.upload()

  stockIndexDataDf = pd.read_csv('./stock_index_data.csv')
  print(stockIndexDataDf)
#+END_SRC


#+latex:\newpage

* Footnotes

[fn:1][[https://oranwind.org/python-pandas-ji-chu-jiao-xue/][Pandas 基礎教學]]
