PD.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-07-03 Sun 20:43 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Pandas</title>
<meta name="author" content="Yung-Chin Yen" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../css/white.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Pandas</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgdf2b5a0">1. Pandas 簡介</a></li>
<li><a href="#org0762d98">2. Pandas 提供的資料結構</a></li>
<li><a href="#orge94d9df">3. Pandas 實作</a>
<ul>
<li><a href="#org10cede8">3.1. 檔案讀寫</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgdf2b5a0" class="outline-2">
<h2 id="orgdf2b5a0"><span class="section-number-2">1.</span> Pandas 簡介</h2>
<div class="outline-text-2" id="text-1">
<p>
Pandas 是 python 的一個數據分析 lib，2009 年底開源出來，提供高效能、簡易使用的資料格式(Data Frame)讓使用者可以快速操作及分析資料，主要特色描述如下<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>：<br />
</p>
<ol class="org-ol">
<li>在異質數據的讀取、轉換和處理上，都讓分析人員更容易處理，例如：從列欄試算表中找到想要的值。<br /></li>
<li>Pandas 提供兩種主要的資料結構，Series 與 DataFrame。Series 顧名思義就是用來處理時間序列相關的資料(如感測器資料等)，主要為建立索引的一維陣列。DataFrame 則是用來處理結構化(Table like)的資料，有列索引與欄標籤的二維資料集，例如關聯式資料庫、CSV 等等。<br /></li>
<li>透過載入至 Pandas 的資料結構物件後，可以透過結構化物件所提供的方法，來快速地進行資料的前處理，如資料補值，空值去除或取代等。<br /></li>
<li>更多的輸入來源及輸出整合性，例如：可以從資料庫讀取資料進入 Dataframe，也可將處理完的資料存回資料庫。<br /></li>
</ol>
</div>
</div>

<div id="outline-container-org0762d98" class="outline-2">
<h2 id="org0762d98"><span class="section-number-2">2.</span> Pandas 提供的資料結構</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>Series：用來處理時間序列相關的資料(如感測器資料等)，主要為建立索引的一維陣列。<br /></li>
<li>DataFrame：用來處理結構化(Table like)的資料，有列索引與欄標籤的二維資料集，例如關聯式資料庫、CSV 等等。<br /></li>
<li>Panel：用來處理有資料及索引、列索引與欄標籤的三維資料集。<br /></li>
</ol>
</div>
</div>

<div id="outline-container-orge94d9df" class="outline-2">
<h2 id="orge94d9df"><span class="section-number-2">3.</span> Pandas 實作</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org10cede8" class="outline-3">
<h3 id="org10cede8"><span class="section-number-3">3.1.</span> 檔案讀寫</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>讀入<br /></li>
</ul>
<div class="org-src-container">
<pre class="src src-python"><span class="linenr">1: </span>  <span style="color: #51afef;">import</span> pandas <span style="color: #51afef;">as</span> pd
<span class="linenr">2: </span>
<span class="linenr">3: </span>  <span style="color: #dcaeea;">csv_file</span> = <span style="color: #98be65;">"https://storage.googleapis.com/learn_pd_like_tidyverse/gapminder.csv"</span>
<span class="linenr">4: </span>  <span style="color: #dcaeea;">gapminder</span> = pd.read_csv(csv_file)
<span class="linenr">5: </span>  <span style="color: #c678dd;">print</span>(<span style="color: #c678dd;">type</span>(gapminder))
<span class="linenr">6: </span>  <span style="color: #c678dd;">print</span>(gapminder.head())
</pre>
</div>

<pre class="example">
&lt;class 'pandas.core.frame.DataFrame'&gt;
       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106
</pre>


<ul class="org-ul">
<li>get remote csv to Google Colab<br /></li>
</ul>
<div class="org-src-container">
<pre class="src src-python"><span class="linenr">1: </span>  <span style="color: #5B6268;">#</span><span style="color: #5B6268;">run on Google Colab</span>
<span class="linenr">2: </span>  <span style="color: #51afef;">import</span> pandas <span style="color: #51afef;">as</span> pd
<span class="linenr">3: </span>
<span class="linenr">4: </span>  <span style="color: #51afef;">from</span> google.colab <span style="color: #51afef;">import</span> files
<span class="linenr">5: </span>  <span style="color: #dcaeea;">uploaded</span> = files.upload()
<span class="linenr">6: </span>
<span class="linenr">7: </span>  <span style="color: #dcaeea;">stockIndexDataDf</span> = pd.read_csv(<span style="color: #98be65;">'./stock_index_data.csv'</span>)
<span class="linenr">8: </span>  <span style="color: #c678dd;">print</span>(stockIndexDataDf)
</pre>
</div>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
<a href="https://oranwind.org/python-pandas-ji-chu-jiao-xue/">Pandas 基礎教學</a><br />
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: Yung-Chin Yen</p>
<p class="date">Created: 2022-07-03 Sun 20:43</p>
</div>
</body>
</html>
